investigation/throughput_23032026.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/throughput.js
        output: -

     scenarios: (100.00%) 3 scenarios, 600 max VUs, 2m0s max duration (incl. graceful stop):
              * low: 50.00 iterations/s for 30s (maxVUs: 50-100, gracefulStop: 30s)
              * medium: 100.00 iterations/s for 30s (maxVUs: 100-200, startTime: 30s, gracefulStop: 30s)
              * high: 200.00 iterations/s for 30s (maxVUs: 200-400, startTime: 1m0s, gracefulStop: 30s)


running (0m00.9s), 000/300 VUs, 46 complete and 0 interrupted iterations
low      [   3% ] 000/050 VUs  00.9s/30s  50.00 iters/s
medium • [   0% ] waiting      29.1s     
high   • [   0% ] waiting      0m59.1s   

running (0m01.9s), 000/300 VUs, 96 complete and 0 interrupted iterations
low      [   6% ] 000/050 VUs  01.9s/30s  50.00 iters/s
medium • [   0% ] waiting      28.1s     
high   • [   0% ] waiting      0m58.1s   

running (0m02.9s), 000/300 VUs, 146 complete and 0 interrupted iterations
low      [  10% ] 000/050 VUs  02.9s/30s  50.00 iters/s
medium • [   0% ] waiting      27.1s     
high   • [   0% ] waiting      0m57.1s   

running (0m03.9s), 000/300 VUs, 196 complete and 0 interrupted iterations
low      [  13% ] 000/050 VUs  03.9s/30s  50.00 iters/s
medium • [   0% ] waiting      26.1s     
high   • [   0% ] waiting      0m56.1s   

running (0m04.9s), 000/300 VUs, 246 complete and 0 interrupted iterations
low      [  16% ] 000/050 VUs  04.9s/30s  50.00 iters/s
medium • [   0% ] waiting      25.1s     
high   • [   0% ] waiting      0m55.1s   

running (0m05.9s), 000/300 VUs, 296 complete and 0 interrupted iterations
low      [  20% ] 000/050 VUs  05.9s/30s  50.00 iters/s
medium • [   0% ] waiting      24.1s     
high   • [   0% ] waiting      0m54.1s   

running (0m06.9s), 000/300 VUs, 346 complete and 0 interrupted iterations
low      [  23% ] 000/050 VUs  06.9s/30s  50.00 iters/s
medium • [   0% ] waiting      23.1s     
high   • [   0% ] waiting      0m53.1s   

running (0m08.7s), 000/300 VUs, 396 complete and 0 interrupted iterations
low      [  26% ] 000/050 VUs  07.9s/30s  50.00 iters/s
medium • [   0% ] waiting      22.1s     
high   • [   0% ] waiting      0m52.1s   

running (0m09.7s), 000/300 VUs, 446 complete and 0 interrupted iterations
low      [  30% ] 000/050 VUs  08.9s/30s  50.00 iters/s
medium • [   0% ] waiting      21.1s     
high   • [   0% ] waiting      0m51.1s   

running (0m10.7s), 000/300 VUs, 496 complete and 0 interrupted iterations
low      [  33% ] 000/050 VUs  09.9s/30s  50.00 iters/s
medium • [   0% ] waiting      20.1s     
high   • [   0% ] waiting      0m50.1s   

running (0m11.7s), 000/300 VUs, 546 complete and 0 interrupted iterations
low      [  36% ] 000/050 VUs  10.9s/30s  50.00 iters/s
medium • [   0% ] waiting      19.1s     
high   • [   0% ] waiting      0m49.1s   

running (0m12.7s), 000/300 VUs, 596 complete and 0 interrupted iterations
low      [  40% ] 000/050 VUs  11.9s/30s  50.00 iters/s
medium • [   0% ] waiting      18.1s     
high   • [   0% ] waiting      0m48.1s   

running (0m13.7s), 000/300 VUs, 646 complete and 0 interrupted iterations
low      [  43% ] 000/050 VUs  12.9s/30s  50.00 iters/s
medium • [   0% ] waiting      17.1s     
high   • [   0% ] waiting      0m47.1s   

running (0m14.7s), 000/300 VUs, 696 complete and 0 interrupted iterations
low      [  46% ] 000/050 VUs  13.9s/30s  50.00 iters/s
medium • [   0% ] waiting      16.1s     
high   • [   0% ] waiting      0m46.1s   

running (0m15.7s), 000/300 VUs, 746 complete and 0 interrupted iterations
low      [  50% ] 000/050 VUs  14.9s/30s  50.00 iters/s
medium • [   0% ] waiting      15.1s     
high   • [   0% ] waiting      0m45.1s   

running (0m16.7s), 000/300 VUs, 796 complete and 0 interrupted iterations
low      [  53% ] 000/050 VUs  15.9s/30s  50.00 iters/s
medium • [   0% ] waiting      14.1s     
high   • [   0% ] waiting      0m44.1s   

running (0m17.7s), 000/300 VUs, 846 complete and 0 interrupted iterations
low      [  56% ] 000/050 VUs  16.9s/30s  50.00 iters/s
medium • [   0% ] waiting      13.1s     
high   • [   0% ] waiting      0m43.1s   

running (0m18.7s), 000/300 VUs, 896 complete and 0 interrupted iterations
low      [  60% ] 000/050 VUs  17.9s/30s  50.00 iters/s
medium • [   0% ] waiting      12.1s     
high   • [   0% ] waiting      0m42.1s   

running (0m19.7s), 000/300 VUs, 946 complete and 0 interrupted iterations
low      [  63% ] 000/050 VUs  18.9s/30s  50.00 iters/s
medium • [   0% ] waiting      11.1s     
high   • [   0% ] waiting      0m41.1s   

running (0m20.7s), 000/300 VUs, 996 complete and 0 interrupted iterations
low      [  66% ] 000/050 VUs  19.9s/30s  50.00 iters/s
medium • [   0% ] waiting      10.1s     
high   • [   0% ] waiting      0m40.1s   

running (0m21.7s), 000/300 VUs, 1046 complete and 0 interrupted iterations
low      [  70% ] 000/050 VUs  20.9s/30s  50.00 iters/s
medium • [   0% ] waiting      09.1s     
high   • [   0% ] waiting      0m39.1s   

running (0m22.7s), 000/300 VUs, 1096 complete and 0 interrupted iterations
low      [  73% ] 000/050 VUs  21.9s/30s  50.00 iters/s
medium • [   0% ] waiting      08.1s     
high   • [   0% ] waiting      0m38.1s   

running (0m23.7s), 000/300 VUs, 1146 complete and 0 interrupted iterations
low      [  76% ] 000/050 VUs  22.9s/30s  50.00 iters/s
medium • [   0% ] waiting      07.1s     
high   • [   0% ] waiting      0m37.1s   

running (0m24.7s), 000/300 VUs, 1196 complete and 0 interrupted iterations
low      [  80% ] 000/050 VUs  23.9s/30s  50.00 iters/s
medium • [   0% ] waiting      06.1s     
high   • [   0% ] waiting      0m36.1s   

running (0m25.7s), 000/300 VUs, 1246 complete and 0 interrupted iterations
low      [  83% ] 000/050 VUs  24.9s/30s  50.00 iters/s
medium • [   0% ] waiting      05.1s     
high   • [   0% ] waiting      0m35.1s   

running (0m26.7s), 000/300 VUs, 1296 complete and 0 interrupted iterations
low      [  86% ] 000/050 VUs  25.9s/30s  50.00 iters/s
medium • [   0% ] waiting      04.1s     
high   • [   0% ] waiting      0m34.1s   

running (0m27.7s), 000/300 VUs, 1346 complete and 0 interrupted iterations
low      [  90% ] 000/050 VUs  26.9s/30s  50.00 iters/s
medium • [   0% ] waiting      03.1s     
high   • [   0% ] waiting      0m33.1s   

running (0m28.7s), 000/300 VUs, 1396 complete and 0 interrupted iterations
low      [  93% ] 000/050 VUs  27.9s/30s  50.00 iters/s
medium • [   0% ] waiting      02.1s     
high   • [   0% ] waiting      0m32.1s   

running (0m29.7s), 000/300 VUs, 1446 complete and 0 interrupted iterations
low      [  96% ] 000/050 VUs  28.9s/30s  50.00 iters/s
medium • [   0% ] waiting      01.1s     
high   • [   0% ] waiting      0m31.1s   

running (0m30.7s), 000/300 VUs, 1496 complete and 0 interrupted iterations
low      [ 100% ] 000/050 VUs  29.9s/30s  50.00 iters/s
medium • [   0% ] waiting      00.1s     
high   • [   0% ] waiting      0m30.1s   

running (0m31.7s), 000/300 VUs, 1584 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [   3% ] 000/100 VUs  00.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m29.1s   

running (0m32.7s), 000/300 VUs, 1684 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [   6% ] 000/100 VUs  01.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m28.1s   

running (0m33.7s), 000/300 VUs, 1784 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [   9% ] 000/100 VUs  02.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m27.1s   

running (0m34.7s), 000/300 VUs, 1884 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  13% ] 000/100 VUs  03.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m26.1s   

running (0m35.7s), 000/300 VUs, 1984 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  16% ] 000/100 VUs  04.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m25.1s   

running (0m36.7s), 000/300 VUs, 2084 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  19% ] 000/100 VUs  05.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m24.1s   

running (0m37.7s), 000/300 VUs, 2184 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  23% ] 000/100 VUs  06.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m23.1s   

running (0m38.7s), 000/300 VUs, 2284 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  26% ] 000/100 VUs  07.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m22.1s   

running (0m39.7s), 000/300 VUs, 2384 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  29% ] 000/100 VUs  08.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m21.1s   

running (0m40.7s), 000/300 VUs, 2484 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  33% ] 000/100 VUs  09.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m20.1s   

running (0m42.4s), 000/300 VUs, 2584 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  36% ] 000/100 VUs  10.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m19.1s   

running (0m43.4s), 000/300 VUs, 2684 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  39% ] 000/100 VUs  11.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m18.1s   

running (0m44.4s), 000/300 VUs, 2784 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  43% ] 000/100 VUs  12.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m17.1s   

running (0m45.4s), 000/300 VUs, 2884 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  46% ] 000/100 VUs  13.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m16.1s   

running (0m46.4s), 000/300 VUs, 2984 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  49% ] 000/100 VUs  14.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m15.1s   

running (0m47.4s), 000/300 VUs, 3084 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  53% ] 000/100 VUs  15.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m14.1s   

running (0m48.4s), 000/300 VUs, 3184 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  56% ] 000/100 VUs  16.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m13.1s   

running (0m49.4s), 000/300 VUs, 3284 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  59% ] 000/100 VUs  17.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m12.1s   

running (0m50.4s), 000/300 VUs, 3384 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  63% ] 000/100 VUs  18.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m11.1s   

running (0m51.4s), 000/300 VUs, 3484 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  66% ] 000/100 VUs  19.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m10.1s   

running (0m52.4s), 000/300 VUs, 3584 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  69% ] 000/100 VUs  20.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m09.1s   

running (0m53.4s), 000/300 VUs, 3684 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  73% ] 000/100 VUs  21.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m08.1s   

running (0m54.4s), 000/300 VUs, 3784 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  76% ] 000/100 VUs  22.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m07.1s   

running (0m55.4s), 000/300 VUs, 3884 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  79% ] 000/100 VUs  23.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m06.1s   

running (0m56.4s), 000/300 VUs, 3984 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  83% ] 000/100 VUs  24.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m05.1s   

running (0m57.4s), 000/300 VUs, 4084 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  86% ] 000/100 VUs  25.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m04.1s   

running (0m58.4s), 000/300 VUs, 4184 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  89% ] 000/100 VUs  26.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m03.1s   

running (0m59.4s), 000/300 VUs, 4284 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  93% ] 000/100 VUs  27.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m02.1s   

running (1m00.4s), 000/300 VUs, 4384 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  96% ] 000/100 VUs  28.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m01.1s   

running (1m01.4s), 000/300 VUs, 4484 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium   [  99% ] 000/100 VUs  29.8s/30s  100.00 iters/s
high   • [   0% ] waiting      0m00.1s   

running (1m02.4s), 000/300 VUs, 4687 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [   3% ] 000/200 VUs  00.9s/30s  200.00 iters/s

running (1m03.4s), 001/300 VUs, 4886 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [   6% ] 001/200 VUs  01.9s/30s  200.00 iters/s

running (1m04.4s), 000/300 VUs, 5087 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  10% ] 000/200 VUs  02.9s/30s  200.00 iters/s

running (1m05.4s), 000/300 VUs, 5287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  13% ] 000/200 VUs  03.9s/30s  200.00 iters/s

running (1m06.5s), 003/300 VUs, 5486 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  16% ] 003/200 VUs  04.9s/30s  200.00 iters/s

running (1m07.4s), 000/300 VUs, 5687 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  20% ] 000/200 VUs  05.9s/30s  200.00 iters/s

running (1m08.4s), 000/300 VUs, 5887 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  23% ] 000/200 VUs  06.9s/30s  200.00 iters/s

running (1m09.4s), 001/300 VUs, 6086 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  26% ] 001/200 VUs  07.9s/30s  200.00 iters/s

running (1m10.4s), 000/300 VUs, 6287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  30% ] 000/200 VUs  08.9s/30s  200.00 iters/s

running (1m11.4s), 000/300 VUs, 6487 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  33% ] 000/200 VUs  09.9s/30s  200.00 iters/s

running (1m12.4s), 000/300 VUs, 6687 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  36% ] 000/200 VUs  10.9s/30s  200.00 iters/s

running (1m13.4s), 000/300 VUs, 6887 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  40% ] 000/200 VUs  11.9s/30s  200.00 iters/s

running (1m15.2s), 001/300 VUs, 7086 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  43% ] 001/200 VUs  12.9s/30s  200.00 iters/s

running (1m16.2s), 000/300 VUs, 7287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  46% ] 000/200 VUs  13.9s/30s  200.00 iters/s

running (1m17.2s), 000/300 VUs, 7487 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  50% ] 000/200 VUs  14.9s/30s  200.00 iters/s

running (1m18.2s), 001/300 VUs, 7686 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  53% ] 001/200 VUs  15.9s/30s  200.00 iters/s

running (1m19.2s), 000/300 VUs, 7887 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  56% ] 000/200 VUs  16.9s/30s  200.00 iters/s

running (1m20.2s), 000/300 VUs, 8087 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  60% ] 000/200 VUs  17.9s/30s  200.00 iters/s

running (1m21.2s), 000/300 VUs, 8287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  63% ] 000/200 VUs  18.9s/30s  200.00 iters/s

running (1m22.2s), 001/300 VUs, 8486 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  66% ] 001/200 VUs  19.9s/30s  200.00 iters/s

running (1m23.2s), 000/300 VUs, 8687 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  70% ] 000/200 VUs  20.9s/30s  200.00 iters/s

running (1m24.2s), 001/300 VUs, 8886 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  73% ] 001/200 VUs  21.9s/30s  200.00 iters/s

running (1m25.2s), 000/300 VUs, 9087 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  76% ] 000/200 VUs  22.9s/30s  200.00 iters/s

running (1m26.2s), 000/300 VUs, 9287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  80% ] 000/200 VUs  23.9s/30s  200.00 iters/s

running (1m27.2s), 000/300 VUs, 9487 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  83% ] 000/200 VUs  24.9s/30s  200.00 iters/s

running (1m28.2s), 000/300 VUs, 9687 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  86% ] 000/200 VUs  25.9s/30s  200.00 iters/s

running (1m29.2s), 000/300 VUs, 9887 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  90% ] 000/200 VUs  26.9s/30s  200.00 iters/s

running (1m30.2s), 000/300 VUs, 10087 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  93% ] 000/200 VUs  27.9s/30s  200.00 iters/s

running (1m31.2s), 000/300 VUs, 10287 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [  96% ] 000/200 VUs  28.9s/30s  200.00 iters/s

running (1m32.2s), 000/300 VUs, 10487 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s        100.00 iters/s
high     [ 100% ] 000/200 VUs  29.9s/30s  200.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=5.11ms
    ✓ 'p(99)<1000' p(99)=21.04ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 21012   227.616673/s
    checks_succeeded...: 100.00% 21012 out of 21012
    checks_failed......: 0.00%   0 out of 21012

    ✓ status is 201
    ✓ has user id

    HTTP
    http_req_duration..............: avg=3.22ms min=1.45ms med=2.23ms max=779.78ms p(90)=3.04ms p(95)=5.11ms
      { expected_response:true }...: avg=3.22ms min=1.45ms med=2.23ms max=779.78ms p(90)=3.04ms p(95)=5.11ms
    http_req_failed................: 0.00%  0 out of 10507
    http_reqs......................: 10507  113.819169/s

    EXECUTION
    iteration_duration.............: avg=3.68ms min=1.72ms med=2.59ms max=326.48ms p(90)=3.55ms p(95)=5.83ms
    iterations.....................: 10506  113.808337/s
    vus............................: 0      min=0          max=3  
    vus_max........................: 300    min=300        max=300

    NETWORK
    data_received..................: 2.2 MB 24 kB/s
    data_sent......................: 2.1 MB 23 kB/s



running (1m32.3s), 000/300 VUs, 10506 complete and 0 interrupted iterations
low    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
medium ✓ [ 100% ] 000/100 VUs  30s  100.00 iters/s
high   ✓ [ 100% ] 000/200 VUs  30s  200.00 iters/s